# Statistical Learning

## Customer Segments
## Dr. Alla Petukhina

### Name: Thi Thuy Le 
### Matrikelnummer: S0564314

### 1. Daten Analysis

In [2]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns
import sklearn.metrics as sm
from collections import Counter
from sklearn.cluster import KMeans
from pandas import DataFrame
from sklearn.cluster import AgglomerativeClustering

We need to import the necessary libraries.

### Data Upload

We will work with the file Mall_Customers below, so we need to upload this file.

In [3]:
df = pd.read_csv('Mall_Customers.csv')

#### 1.1 Data verification

##### 1.1.1 Data

With this code we give a quick reference. And this is what the Dataframe I need to create
looks like.

In [4]:
df.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

CustomerID: Unique ID assigned to the customer.\
Gender: Gender of the customer.\
Age: Age of the customer.\
Annual Income (k$): Annual Income of the customer.\
Spending Score: Score assigned by the mall based on customer behavior and spending nature.

##### 1.1.2 Infomation of Data

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Genre                   200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

##### 1.1.3 Mean, Min, Max, Median, Standard Deviation of data

In [5]:
df.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

##### 1.1.4 Check MissingValues NaN

We can check if there are any MissingValues.

In [6]:
df.isnull()

     CustomerID  Genre    Age  Annual Income (k$)  Spending Score (1-100)
0         False  False  False               False                   False
1         False  False  False               False                   False
2         False  False  False               False                   False
3         False  False  False               False                   False
4         False  False  False               False                   False
..          ...    ...    ...                 ...                     ...
195       False  False  False               False                   False
196       False  False  False               False                   False
197       False  False  False               False                   False
198       False  False  False               False                   False
199       False  False  False               False                   False

[200 rows x 5 columns]

##### Sum of MissingValues

Because sometimes the data is too long, we can't find the Missingvalues, so we will need this code to sum it up.

In [7]:
df.isnull().sum()

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

There are no missing values.